# Create & Access SQLite database using Python

## Objectives

After completing this lab you will be able to:

*   Create a database
*   Create a table
*   Insert data into the table
*   Query data from the table
*   Retrieve the result set into a pandas dataframe
*   Close the database connection

## Task 1: Create database using SQLite

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('INSTRUCTOR.db')

In [3]:
cursor_obj = conn.cursor()

## Task 2: Create a table in the database

In [4]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [5]:
table = """CREATE TABLE IF NOT EXISTS INSTRUCTOR (ID INT PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""

cursor_obj.execute(table)

print("Table is ready")

Table is ready

In [6]:
cursor_obj.execute('''INSERT INTO INSTRUCTOR VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [7]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

In [8]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print('All files')
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All files
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [10]:
statement_2 = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(stament_2)

print("All the data")
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [11]:
statement_3 = '''SELECT FNAME, LNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement_3)

output_selected = cursor_obj.fetchall()
for row_selected in output_selected:
    print(row_selected)

('Rav', 'Ahuja')
('Raul', 'Chong')
('Hima', 'Vasudevan')

In [12]:
import pandas as pd

In [13]:
df = pd.read_sql_query('SELECT * FROM INSTRUCTOR;', conn)
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  TORONTO    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

In [14]:
df.LNAME[0]

'Ahuja'

In [18]:
df.shape

(3, 5)

In [20]:
df.to_csv('df_sql.csv')